
import { Slider } from '@/components/Slider/Slider';
// import s from './HomeNews.module.css';

import { Container, SectionTitle } from '@/components';

export function HomeNews({ allNews }) {
  return (
    <section>
      <Container>
        <SectionTitle title={'Новини'} h2 centered />
              <Slider allNews={allNews} />
      </Container>
    </section>
  );
}


// [
//   {
//     id: '129420316',
//     title: 'Новина 2',
//     text:
//       'Провела лекцію на тему «Як виявити свої сильні сторони і навчитися використовувати їх в стресових ситуаціях». І отримала відгук від одної із учасниць, що вона після лекції відчула, що в неї як би хто-то натиснув всередині на кнопку «Живи»\n' +
//       '\n' +
//       '**Дуже вдячна за такий зворотній зв‘язок.**\n' +
//       '\n' +
//       'Бо то саме те, що я намагаюся нести в своїх лекціях та консультаціях. Що життя повинно перемогти смерть в кожному з нас. І то буде наша особиста перемога. Що можно і потрібно відшукати свої внутрішні опори, стати більш зрілими та мудрими. І навіть, якщо опалили біль і горе, потрошку отогрітеся і знайти свої сенси\n' +
//       '\n' +
//       'Нам зараз або вниз - в смуток, апатію, дипресію і безсилля, або вверх - в силу, опорність, зрілість і любов',
//     image: {
//       alt: 'Новина 2',
//       url: 'https://www.datocms-assets.com/102412/1686593854-new2.jpg',
//     },
//     _publishedAt: '2023-06-12T19:17:56+01:00',
//   },
//   {
//     id: '128812112',
//     title: 'Новина 1',
//     text:
//       '5 березня закінчилися 4 продуктивні **сесії \n' +
//       'з навчання методу роботи з травмою \n' +
//       'та ПТСР SEE FAR CBT** [від Community Stress Prevention Center](https://www.facebook.com/icspc/?__cft__%5b0%5d=AZW1WwRVRHwguXRzPXNuwo9FzqssAL9-VJRMd0LLFlqNZP0DISxMzArSPz3AgR9BthvDx7GoYyzRmdNj4EoAF_s6zS0LX4Y_y8lxXlaQq-5d1lG35EUFaWbfbKPBrQza1eEk7edHIIIk2794poOx6Ua-x4KDJ_OMHv_UAse8V8xAs-LaNEHbpAgkRPGlkONKkiE&__tn__=kK-R) під керівництвом професора и автора метода Мулі Лахада. Величезна подяка професору за метод, чудові лекції, глибокі знання. Дякую команді тренерів: Марку, Нірі, Яель та Мейрі – ви щедро ділилися з нами безцінним досвідом. Навчання було організовано ELNET-Poland.\n' +
//       '\n' +
//       '**Нас навчали не просто працювати в методі в індивідуальній роботі, а навчати інших фахівців**, передаючи знання далі. Зараз Україна переживає складні часи, попереду багато роботи по відновленню, в тому числі і психічного здоров’я. Чим більше психологів буде мати на озброєнні дієві методи лікування ПТСР та травматичних розладів – тим краще і швидше вдасться виконати це завдання.\n' +
//       '\n' +
//       'Багато праці нам ще належить докладати щодня. Але після таких ресурсних зустрічей, готовність передавати знання стає ще більше, хочеться допомогти якомога більшій кількості людей.\n' +
//       '\n' +
//       '**Ми всі боремся за нашу єдність і плоди обов’язково будуть щедрими.**\n' +
//       '\n' +
//       '**Слава Україні!!!**',
//     image: {
//       alt: 'Новина 1',
//       url: 'https://www.datocms-assets.com/102412/1686593783-new1.jpg',
//     },
//     _publishedAt: '2023-06-12T19:17:03+01:00',
//   },
// ];